vojt444/picoballoon/SW/picoballoon_v1/MCXC242_Project/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_init_sleep_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_init_sleep_pins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t GNSS_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 61)  */
    GPIO_PinInit(BOARD_INIT_SLEEP_PINS_GNSS_EN_GPIO, BOARD_INIT_SLEEP_PINS_GNSS_EN_PIN, &GNSS_EN_config);

    /* PORTA0 (pin 22) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_DEBUG_SWD_SWDCLK_PORT, BOARD_INIT_SLEEP_PINS_DEBUG_SWD_SWDCLK_PIN, kPORT_PinDisabledOrAnalog);

    PORTA->PCR[0] = ((PORTA->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA1 (pin 23) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_DEBUG_UART_RX_PORT, BOARD_INIT_SLEEP_PINS_DEBUG_UART_RX_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA12 (pin 28) is disabled */
    PORT_SetPinMux(PORTA, 12U, kPORT_PinDisabledOrAnalog);

    /* PORTA13 (pin 29) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_LED_BLUE_PORT, BOARD_INIT_SLEEP_PINS_LED_BLUE_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA2 (pin 24) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_DEBUG_UART_TX_PORT, BOARD_INIT_SLEEP_PINS_DEBUG_UART_TX_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA20 (pin 34) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_SW1_PORT, BOARD_INIT_SLEEP_PINS_SW1_PIN, kPORT_PinDisabledOrAnalog);

    PORTA->PCR[20] = ((PORTA->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding
                       * pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA3 (pin 25) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_DEBUG_SWD_SWDIO_PORT, BOARD_INIT_SLEEP_PINS_DEBUG_SWD_SWDIO_PIN, kPORT_PinDisabledOrAnalog);

    PORTA->PCR[3] = ((PORTA->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA4 (pin 26) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_SW3_PORT, BOARD_INIT_SLEEP_PINS_SW3_PIN, kPORT_PinDisabledOrAnalog);

    PORTA->PCR[4] = ((PORTA->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable)

                     /* Passive Filter Enable: Passive input filter is disabled on the corresponding pin. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterDisable));

    /* PORTA5 (pin 27) is disabled */
    PORT_SetPinMux(PORTA, 5U, kPORT_PinDisabledOrAnalog);

    /* PORTB16 (pin 39) is disabled */
    PORT_SetPinMux(PORTB, 16U, kPORT_PinDisabledOrAnalog);

    /* PORTB17 (pin 40) is disabled */
    PORT_SetPinMux(PORTB, 17U, kPORT_PinDisabledOrAnalog);

    /* PORTB18 (pin 41) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_LED_RED_PORT, BOARD_INIT_SLEEP_PINS_LED_RED_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB19 (pin 42) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_LED_GREEN_PORT, BOARD_INIT_SLEEP_PINS_LED_GREEN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC10 (pin 55) is disabled */
    PORT_SetPinMux(PORTC, 10U, kPORT_PinDisabledOrAnalog);

    /* PORTC11 (pin 56) is disabled */
    PORT_SetPinMux(PORTC, 11U, kPORT_PinDisabledOrAnalog);

    /* PORTC3 (pin 46) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_SDN_PORT, BOARD_INIT_SLEEP_PINS_SDN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC4 (pin 49) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_CS_PORT, BOARD_INIT_SLEEP_PINS_CS_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC5 (pin 50) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_SCLK_PORT, BOARD_INIT_SLEEP_PINS_SCLK_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTD0 (pin 57) is disabled */
    PORT_SetPinMux(PORTD, 0U, kPORT_PinDisabledOrAnalog);

    /* PORTD2 (pin 59) is disabled */
    PORT_SetPinMux(PORTD, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTD3 (pin 60) is disabled */
    PORT_SetPinMux(PORTD, 3U, kPORT_PinDisabledOrAnalog);

    /* PORTD4 (pin 61) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_GNSS_EN_PORT, BOARD_INIT_SLEEP_PINS_GNSS_EN_PIN, kPORT_MuxAsGpio);

    /* PORTD7 (pin 64) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_TX_PORT, BOARD_INIT_SLEEP_PINS_TX_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE0 (pin 1) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_SDA_GNSS_PORT, BOARD_INIT_SLEEP_PINS_SDA_GNSS_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE1 (pin 2) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_SCL_GNSS_PORT, BOARD_INIT_SLEEP_PINS_SCL_GNSS_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE24 (pin 20) is disabled */
    PORT_SetPinMux(PORTE, 24U, kPORT_PinDisabledOrAnalog);

