vojt444/picoballoon/SW/picoballoon_v1/MCXC242_Project/board/pin_mux.c
    /* PORTE25 (pin 21) is disabled */
    PORT_SetPinMux(PORTE, 25U, kPORT_PinDisabledOrAnalog);

    /* PORTE31 (pin 19) is disabled */
    PORT_SetPinMux(PORTE, 31U, kPORT_PinDisabledOrAnalog);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_init_sleep_pins_deinit
 * Description   : This is a de-initialization function for 'BOARD_init_sleep_pins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void BOARD_init_sleep_pins_deinit(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    const port_pin_config_t DEBUG_SWD_SWDCLK = {/* Internal pull-down resistor is enabled */
                                                .pullSelect = kPORT_PullDown,
                                                /* Slow slew rate is configured */
                                                .slewRate = kPORT_SlowSlewRate,
                                                /* Passive filter is disabled */
                                                .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                /* Low drive strength is configured */
                                                .driveStrength = kPORT_LowDriveStrength,
                                                /* Pin is configured as SWD_CLK */
                                                .mux = kPORT_MuxAlt7};
    /* PORTA0 (pin 22) is configured as SWD_CLK */
    PORT_SetPinConfig(BOARD_INIT_SLEEP_PINS_DEINIT_DEBUG_SWD_SWDCLK_PORT, BOARD_INIT_SLEEP_PINS_DEINIT_DEBUG_SWD_SWDCLK_PIN, &DEBUG_SWD_SWDCLK);

    /* PORTA1 (pin 23) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_DEINIT_DEBUG_UART_RX_PORT, BOARD_INIT_SLEEP_PINS_DEINIT_DEBUG_UART_RX_PIN, kPORT_PinDisabledOrAnalog);

    PORTA->PCR[1] = ((PORTA->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable)

                     /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTA12 (pin 28) is disabled */
    PORT_SetPinMux(PORTA, 12U, kPORT_PinDisabledOrAnalog);

    PORTA->PCR[12] = ((PORTA->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp)

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding
                       * pin. */
                      | PORT_PCR_PE(kPORT_PullDisable)

                      /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTA13 (pin 29) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_DEINIT_LED_BLUE_PORT, BOARD_INIT_SLEEP_PINS_DEINIT_LED_BLUE_PIN, kPORT_PinDisabledOrAnalog);

    PORTA->PCR[13] = ((PORTA->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp)

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding
                       * pin. */
                      | PORT_PCR_PE(kPORT_PullDisable)

                      /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTA2 (pin 24) is disabled */
    PORT_SetPinMux(BOARD_INIT_SLEEP_PINS_DEINIT_DEBUG_UART_TX_PORT, BOARD_INIT_SLEEP_PINS_DEINIT_DEBUG_UART_TX_PIN, kPORT_PinDisabledOrAnalog);

    PORTA->PCR[2] = ((PORTA->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable)

